Revit 2027 API
Face.Intersect(Face) Method
Calculates the intersection of the specified face with this face and returns the intersection results.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FaceIntersectionFaceResult Intersect(
	Face face
)
Public Function Intersect (
	face As Face
) As FaceIntersectionFaceResult
public:
FaceIntersectionFaceResult Intersect(
	Face^ face
)
member Intersect :
        face : Face -> FaceIntersectionFaceResult
Parameters
face Face
The specified face to intersect with this face.
Return Value
FaceIntersectionFaceResult
FaceIntersectionFaceResult.Intersecting - One or more intersections were encountered.
SetComparisonResult.NonIntersecting - There is no intersection found.
Exceptions
Exception | Condition
ArgumentNullException |  The face is null.
InvalidOperationException |  The intersection calculation fails.
Remarks
 This is not a general-purpose function: it only works properly for simple configurations. For other configurations, it may return an incorrect result. Some configurations for which the function might return a correct result are:
A planar face that fully intersects another face in a single curve, when the other face is planar or cylindrical.
A cylindrical face that fully intersects another face in a single curve, when the other face is planar.
See Also
Reference
Face Class
Intersect Overload
Autodesk.Revit.DB Namespace